Res-social/Res-container-random-v1/container_t_4_c_6_readHomeTimeline_composeCore_6_wrkCore_1/wrk.txt
Running 1m test @ http://localhost:8080/wrk2-api/home-timeline/read
  4 threads and 6 connections
  Thread calibration: mean lat.: 3881.967ms, rate sampling interval: 15507ms
  Thread calibration: mean lat.: 4371.047ms, rate sampling interval: 16769ms
  Thread calibration: mean lat.: 4420.825ms, rate sampling interval: 16777ms
  Thread calibration: mean lat.: 4509.495ms, rate sampling interval: 16793ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    22.59s    14.21s    0.94m    65.24%
    Req/Sec    60.78      2.10    63.00     88.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.56s 
 75.000%   32.95s 
 90.000%   42.83s 
 99.000%    0.94m 
 99.900%    0.97m 
 99.990%    0.98m 
 99.999%    0.98m 
100.000%    0.98m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.103     0.000000            1         1.00
    5017.599     0.100000         1229         1.11
    9601.023     0.200000         2461         1.25
   12427.263     0.300000         3684         1.43
   16285.695     0.400000         4911         1.67
   20561.919     0.500000         6139         2.00
   23052.287     0.550000         6754         2.22
   25591.807     0.600000         7368         2.50
   28065.791     0.650000         7981         2.86
   30490.623     0.700000         8594         3.33
   32948.223     0.750000         9214         4.00
   34209.791     0.775000         9519         4.44
   35454.975     0.800000         9828         5.00
   37027.839     0.825000        10129         5.71
   38666.239     0.850000        10439         6.67
   40370.175     0.875000        10744         8.00
   41582.591     0.887500        10898         8.89
   42860.543     0.900000        11055        10.00
   43974.655     0.912500        11203        11.43
   45187.071     0.925000        11358        13.33
   46465.023     0.937500        11512        16.00
   47579.135     0.943750        11588        17.78
   48791.551     0.950000        11664        20.00
   49971.199     0.956250        11742        22.86
   51183.615     0.962500        11818        26.67
   52396.031     0.968750        11894        32.00
   53051.391     0.971875        11932        35.56
   53673.983     0.975000        11973        40.00
   54263.807     0.978125        12011        45.71
   54886.399     0.981250        12048        53.33
   55541.759     0.984375        12087        64.00
   55836.671     0.985938        12105        71.11
   56164.351     0.987500        12126        80.00
   56459.263     0.989062        12144        91.43
   56754.175     0.990625        12162       106.67
   57147.391     0.992188        12185       128.00
   57245.695     0.992969        12191       142.22
   57442.303     0.993750        12203       160.00
   57540.607     0.994531        12211       182.86
   57671.679     0.995313        12221       213.33
   57868.287     0.996094        12232       256.00
   57933.823     0.996484        12235       284.44
   57966.591     0.996875        12239       320.00
   58064.895     0.997266        12246       365.71
   58163.199     0.997656        12252       426.67
   58228.735     0.998047        12254       512.00
   58261.503     0.998242        12257       568.89
   58327.039     0.998437        12259       640.00
   58359.807     0.998633        12264       731.43
   58359.807     0.998828        12264       853.33
   58458.111     0.999023        12271      1024.00
   58458.111     0.999121        12271      1137.78
   58458.111     0.999219        12271      1280.00
   58458.111     0.999316        12271      1462.86
   58458.111     0.999414        12271      1706.67
   58523.647     0.999512        12272      2048.00
   58523.647     0.999561        12272      2275.56
   58556.415     0.999609        12276      2560.00
   58556.415     0.999658        12276      2925.71
   58556.415     0.999707        12276      3413.33
   58556.415     0.999756        12276      4096.00
   58556.415     0.999780        12276      4551.11
   58556.415     0.999805        12276      5120.00
   58556.415     0.999829        12276      5851.43
   58556.415     0.999854        12276      6826.67
   58556.415     0.999878        12276      8192.00
   58556.415     0.999890        12276      9102.22
   58556.415     0.999902        12276     10240.00
   58556.415     0.999915        12276     11702.86
   58589.183     0.999927        12277     13653.33
   58589.183     1.000000        12277          inf
#[Mean    =    22590.055, StdDeviation   =    14206.677]
#[Max     =    58556.416, Total count    =        12277]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  13890 requests in 1.00m, 193.92MB read
  Socket errors: connect 0, read 0, write 0, timeout 93
Requests/sec:    231.48
Transfer/sec:      3.23MB